Revit 2027 API
CompoundStructure.GetWidth(Int32) Method
 Computes the width of the envelope (2d bounding box) of the specified region.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetWidth(
	int regionId
)
Public Function GetWidth (
	regionId As Integer
) As Double
public:
double GetWidth(
	int regionId
)
member GetWidth :
        regionId : int -> float
Parameters
regionId Int32
 The id of a region in this vertically compound structure.
Return Value
Double
 The width of the envelope (2d bounding box) of the region.
Exceptions
Exception | Condition
ArgumentException |  It is not a valid region id.
InvalidOperationException |  This operation is valid only for vertically compound structures.
See Also
Reference
CompoundStructure Class
GetWidth Overload
Autodesk.Revit.DB Namespace